### DSS ###
name: "DSS"
layer {
      name: "data"
      type: "Python"
      top: "data"
      top: "depth"
     
     
      python_param {
        module: "ImageLabelDataTest"
        layer: "ImageLabelDataTest"
        #param_str: "{\'root_folder\': \'/opt/Dataset/depth_saliency/RGBD_Saliency/nju2000/nju2k/\',\'source\': \'/opt/Dataset/depth_saliency/RGBD_Saliency/nju2000/nju2000/test_depth.lst\',  \'mean\': (119.36,119.36,119.36), \'random\': 0, \'seed\': 1337, \'mirror\': 0, \'new_height\':0, \'new_width\':0}"
        param_str: "{\'root_folder\': \'/media/ubuntu/disk/Dataset/DPFan/Dataset/NJU2K/\',\'source\': \'/media/ubuntu/disk/Dataset/DPFan/Dataset/NJU2K/test.lst\',  \'mean\': (119.36,119.36,119.36), \'random\': 0, \'seed\': 1337, \'mirror\': 0, \'new_height\':0, \'new_width\':0}"
     }
     }



### 3 depth branches


#pool1
## 2c
layer {
    bottom: "depth"
    top: "conv1_d0_1"
    name: "conv1_d0_1"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d0_1"
	top: "conv1_d0_1"
	name: "conv1_d0_1_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d0_1"
    top: "conv1_d0_2"
    name: "conv1_d0_2"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d0_2"
	top: "conv1_d0_2"
	name: "conv1_d0_2_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d0_2"
    top: "conv1_d0_3"
    name: "conv1_d0_3"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 3 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d0_3"
	top: "conv1_d0_3"
	name: "conv1_d0_3_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d0_3"
    top: "conv1_d0_4"
    name: "conv1_d0_4"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 1 pad: 2 kernel_size: 3 stride: 1
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Sigmoid" name: "sigmoid-d0" bottom: "conv1_d0_4" top: "weight_map_d0"  }





## 2c
layer {
    bottom: "depth"
    top: "conv1_d1_1"
    name: "conv1_d1_1"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d1_1"
	top: "conv1_d1_1"
	name: "conv1_d1_1_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d1_1"
    top: "conv1_d1_2"
    name: "conv1_d1_2"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d1_2"
	top: "conv1_d1_2"
	name: "conv1_d1_2_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d1_2"
    top: "conv1_d1_3"
    name: "conv1_d1_3"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d1_3"
	top: "conv1_d1_3"
	name: "conv1_d1_3_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d1_3"
    top: "conv1_d1_4"
    name: "conv1_d1_4"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 1 pad: 2 kernel_size: 3 stride: 1
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Sigmoid" name: "sigmoid-d1" bottom: "conv1_d1_4" top: "weight_map_d1"  }



## 3d
layer {
    bottom: "depth"
    top: "conv1_d2_1"
    name: "conv1_d2_1"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d2_1"
	top: "conv1_d2_1"
	name: "conv1_d2_1_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d2_1"
    top: "conv1_d2_2"
    name: "conv1_d2_2"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d2_2"
	top: "conv1_d2_2"
	name: "conv1_d2_2_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d2_2"
    top: "conv1_d2_3"
    name: "conv1_d2_3"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d2_3"
	top: "conv1_d2_3"
	name: "conv1_d2_3_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d2_3"
    top: "conv1_d2_4"
    name: "conv1_d2_4"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 3 stride: 1
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d2_4"
	top: "conv1_d2_4"
	name: "conv1_d2_4_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d2_4"
    top: "conv1_d2_5"
    name: "conv1_d2_5"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d2_5"
	top: "conv1_d2_5"
	name: "conv1_d2_5_relu"
	type: "ReLU"
}

layer {
    bottom: "conv1_d2_5"
    top: "conv1_d2_6"
    name: "conv1_d2_6"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 1 pad: 2 kernel_size: 3 stride: 1
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Sigmoid" name: "sigmoid-d2" bottom: "conv1_d2_6" top: "weight_map_d2"  }



# ## 4f
 layer {
     bottom: "depth"
     top: "conv1_d3_1"
     name: "conv1_d3_1"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }
    
layer {
	bottom: "conv1_d3_1"
	top: "conv1_d3_1"
	name: "conv1_d3_1_relu"
	type: "ReLU"
}
    
 layer {
     bottom: "conv1_d3_1"
     top: "conv1_d3_2"
     name: "conv1_d3_2"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 stride: 1 
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d3_2"
	top: "conv1_d3_2"
	name: "conv1_d3_2_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d3_2"
     top: "conv1_d3_3"
     name: "conv1_d3_3"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2 
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d3_3"
	top: "conv1_d3_3"
	name: "conv1_d3_3_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d3_3"
     top: "conv1_d3_4"
     name: "conv1_d3_4"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 3 stride: 1
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d3_4"
	top: "conv1_d3_4"
	name: "conv1_d3_4_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d3_4"
     top: "conv1_d3_5"
     name: "conv1_d3_5"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2 
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d3_5"
	top: "conv1_d3_5"
	name: "conv1_d3_5_relu"
	type: "ReLU"
}


 layer {
     bottom: "conv1_d3_5"
     top: "conv1_d3_6"
     name: "conv1_d3_6"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 3 stride: 1
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d3_6"
	top: "conv1_d3_6"
	name: "conv1_d3_6_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d3_6"
     top: "conv1_d3_7"
     name: "conv1_d3_7"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2 
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d3_7"
	top: "conv1_d3_7"
	name: "conv1_d3_7_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d3_7"
     top: "conv1_d3_8"
     name: "conv1_d3_8"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 1 pad: 2 kernel_size: 3 stride: 1
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

 layer { type: "Sigmoid" name: "sigmoid-d3" bottom: "conv1_d3_8" top: "weight_map_d3"  }
 
 



 ## 5c
 layer {
     bottom: "depth"
     top: "conv1_d4_1"
     name: "conv1_d4_1"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d4_1"
	top: "conv1_d4_1"
	name: "conv1_d4_1_relu"
	type: "ReLU"
}


 layer {
     bottom: "conv1_d4_1"
     top: "conv1_d4_2"
     name: "conv1_d4_2"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 stride: 1 
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d4_2"
	top: "conv1_d4_2"
	name: "conv1_d4_2_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d4_2"
     top: "conv1_d4_3"
     name: "conv1_d4_3"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2 
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d4_3"
	top: "conv1_d4_3"
	name: "conv1_d4_3_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d4_3"
     top: "conv1_d4_4"
     name: "conv1_d4_4"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 3 stride: 1
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d4_4"
	top: "conv1_d4_4"
	name: "conv1_d4_4_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d4_4"
     top: "conv1_d4_5"
     name: "conv1_d4_5"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2 
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d4_5"
	top: "conv1_d4_5"
	name: "conv1_d4_5_relu"
	type: "ReLU"
}
    
 layer {
     bottom: "conv1_d4_5"
     top: "conv1_d4_6"
     name: "conv1_d4_6"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 3 stride: 1 
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d4_6"
	top: "conv1_d4_6"
	name: "conv1_d4_6_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d4_6"
     top: "conv1_d4_7"
     name: "conv1_d4_7"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2 
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }
layer {
	bottom: "conv1_d4_7"
	top: "conv1_d4_7"
	name: "conv1_d4_7_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d4_7"
     top: "conv1_d4_8"
     name: "conv1_d4_8"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 3 stride: 1
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d4_8"
	top: "conv1_d4_8"
	name: "conv1_d4_8_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d4_8"
     top: "conv1_d4_9"
     name: "conv1_d4_9"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 32 pad: 1 kernel_size: 4 stride: 2 
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer {
	bottom: "conv1_d4_9"
	top: "conv1_d4_9"
	name: "conv1_d4_9_relu"
	type: "ReLU"
}

 layer {
     bottom: "conv1_d4_9"
     top: "conv1_d4_10"
     name: "conv1_d4_10"
     type: "Convolution"
     param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
     convolution_param { engine: CAFFE num_output: 1 pad: 2 kernel_size: 3 stride: 1
     weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

 layer { type: "Sigmoid" name: "sigmoid-d4" bottom: "conv1_d4_10" top: "weight_map_d4"  }
 
 
 


###

layer { bottom: 'data' top: 'conv1_1' name: 'conv1_1' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv1_1' top: 'conv1_1' name: 'relu1_1' type: "ReLU" }
layer { bottom: 'conv1_1' top: 'conv1_2' name: 'conv1_2' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv1_2' top: 'conv1_2' name: 'relu1_2' type: "ReLU" }
layer { name: 'pool1' bottom: 'conv1_2' top: 'pool1' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }
  
layer { type: "Crop" name: 'crop0' bottom: 'weight_map_d0' bottom: 'pool1' top: 'weight_map_d0_croped' }

layer {
      name: "add_weight_0"
      type: "Python"
      bottom: "pool1"
      bottom: 'weight_map_d0_croped'
      top: "pool1_weighted"
      python_param {
        module: "add_weight3"
        layer: "addWeight3"
     }
     }

layer {
    bottom: "pool1_weighted"
    top: "pool1_weighted_c"
    name: "pool1_weighted_c"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 64 pad: 1 kernel_size: 3 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }



layer {
	bottom: "pool1"
	bottom: "pool1_weighted_c"
	top: "pool1_weighted_f"
	name: "pool1_weighted_f"
	type: "Eltwise"
}

layer { name: 'conv2_1' bottom: 'pool1_weighted_f' top: 'conv2_1' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv2_1' top: 'conv2_1' name: 'relu2_1' type: "ReLU" }
layer { bottom: 'conv2_1' top: 'conv2_2' name: 'conv2_2' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv2_2' top: 'conv2_2' name: 'relu2_2' type: "ReLU" }
layer { bottom: 'conv2_2' top: 'pool2' name: 'pool2' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { type: "Crop" name: 'crop1' bottom: 'weight_map_d1' bottom: 'pool2' top: 'weight_map_d1_croped' }

layer {
      name: "add_weight_1"
      type: "Python"
      bottom: "pool2"
      bottom: 'weight_map_d1_croped'
      top: "pool2_weighted"
      python_param {
        module: "add_weight3"
        layer: "addWeight3"
     }
     }

layer {
    bottom: "pool2_weighted"
    top: "pool2_weighted_c"
    name: "pool2_weighted_c"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }



layer {
	bottom: "pool2"
	bottom: "pool2_weighted_c"
	top: "res2c_weighted_e"
	name: "res2c_weighted_e"
	type: "Eltwise"
}

layer { bottom: 'res2c_weighted_e' top: 'conv3_1' name: 'conv3_1' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv3_1' top: 'conv3_1' name: 'relu3_1' type: "ReLU" }
layer { bottom: 'conv3_1' top: 'conv3_2' name: 'conv3_2' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv3_2' top: 'conv3_2' name: 'relu3_2' type: "ReLU" }
layer { bottom: 'conv3_2' top: 'conv3_3' name: 'conv3_3' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv3_3' top: 'conv3_3' name: 'relu3_3' type: "ReLU" }
layer { bottom: 'conv3_3' top: 'pool3' name: 'pool3' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { type: "Crop" name: 'crop2' bottom: 'weight_map_d2' bottom: "pool3" top: 'weight_map_d2_croped' }

layer {
      name: "add_weight_2"
      type: "Python"
      bottom: "pool3"
      bottom: 'weight_map_d2_croped'
      top: "res3d_weighted"
      python_param {
        module: "add_weight3"
        layer: "addWeight3"
     }
     }


layer {
    bottom: "res3d_weighted"
    top: "res3d_weighted_c"
    name: "res3d_weighted_c"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }



layer {
	bottom: "pool3"
	bottom: "res3d_weighted_c"
	top: "res3d_weighted_e"
	name: "res3d_weighted_e"
	type: "Eltwise"
}


layer { bottom: 'res3d_weighted_e' top: 'conv4_1' name: 'conv4_1' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv4_1' top: 'conv4_1' name: 'relu4_1' type: "ReLU" }
layer { bottom: 'conv4_1' top: 'conv4_2' name: 'conv4_2' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv4_2' top: 'conv4_2' name: 'relu4_2' type: "ReLU" }
layer { bottom: 'conv4_2' top: 'conv4_3' name: 'conv4_3' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv4_3' top: 'conv4_3' name: 'relu4_3' type: "ReLU" }
layer { bottom: 'conv4_3' top: 'pool4' name: 'pool4' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 3 stride: 2 pad: 1 } }


layer { type: "Crop" name: 'crop3' bottom: 'weight_map_d3' bottom: "pool4" top: 'weight_map_d3_croped' }

layer {
      name: "add_weight_3"
      type: "Python"
      bottom: "pool4"
      bottom: 'weight_map_d3_croped'
      top: "res4f_weighted"
      python_param {
        module: "add_weight3"
        layer: "addWeight3"
     }
     }


layer {
    bottom: "res4f_weighted"
    top: "res4f_weighted_c"
    name: "res4f_weighted_c"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }



layer {
	bottom: "pool4"
	bottom: "res4f_weighted_c"
	top: "res4f_weighted_e"
	name: "res4f_weighted_e"
	type: "Eltwise"
}




layer { bottom: 'res4f_weighted_e' top: 'conv5_1' name: 'conv5_1' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv5_1' top: 'conv5_1' name: 'relu5_1' type: "ReLU" }
layer { bottom: 'conv5_1' top: 'conv5_2' name: 'conv5_2' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv5_2' top: 'conv5_2' name: 'relu5_2' type: "ReLU" }
layer { bottom: 'conv5_2' top: 'conv5_3' name: 'conv5_3' type: "Convolution"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 } }
layer { bottom: 'conv5_3' top: 'conv5_3' name: 'relu5_3' type: "ReLU" }
layer { bottom: 'conv5_3' top: 'pool5' name: 'pool5' type: "Pooling"
  pooling_param { pool: MAX kernel_size: 3 stride: 2 pad: 1 } }
layer { bottom: 'pool5' top: 'pool5a' name: 'pool5a' type: "Pooling"
  pooling_param { pool: AVE kernel_size: 3 stride: 1 pad: 1 } }


layer { type: "Crop" name: 'crop4' bottom: 'weight_map_d4' bottom: "pool5a" top: 'weight_map_d4_croped' }

layer {
      name: "add_weight_4"
      type: "Python"
      bottom: "pool5a"
      bottom: 'weight_map_d4_croped'
      top: "res5c_weighted"
      python_param {
        module: "add_weight3"
        layer: "addWeight3"
     }
     }


layer {
    bottom: "res5c_weighted"
    top: "res5c_weighted_c"
    name: "res5c_weighted_c"
    type: "Convolution"
    param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
    convolution_param { engine: CAFFE num_output: 512 pad: 1 kernel_size: 3 stride: 1 
    weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }



layer {
	bottom: "pool5a"
	bottom: "res5c_weighted_c"
	top: "res5c_weighted_e"
	name: "res5c_weighted_e"
	type: "Eltwise"
}





layer { name: 'trans_pool1' type: "Convolution" bottom: "pool1_weighted_f" top: 'down_pool1_weighted_f'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3 stride:2
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }
  
  layer { type: "Crop" name: 'crop_pool1_weighted_e' bottom: 'down_pool1_weighted_f' bottom: "res2c_weighted_e" top: 'pool1_weighted_e' }


################################### PATH 3 ############################################
# Prediction #



layer { name: 'res1_branch1_path3_4' type: "Convolution" bottom: "res5c_weighted_e" top: 'res1_branch1_path3_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path3_4' type: "Convolution" bottom: "res5c_weighted_e" top: 'res1_branch2a_path3_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path3_4" bottom: "res1_branch1_path3_4"  bottom: "res1_branch2a_path3_4"
  top: "res1_path3_4" type: "Eltwise" eltwise_param { operation: 1 } }

  
  
layer { bottom: 'res1_path3_4' top: 'trans_relu_path3_4' name: 'trans_relu_path3_4' type: "ReLU" }
layer { name: 'trans_path3_4' type: "Convolution" bottom: 'trans_relu_path3_4' top: 'trans_path3_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Deconvolution" name: 'upres2_path3_4' bottom: 'trans_path3_4' top: 'upres2_path3_4'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 4 stride: 2 num_output: 256 } }
layer { type: "Crop" name: 'cropres2_path3_4' bottom: 'upres2_path3_4' bottom: "res4f_weighted_e" top: 'cropres2_path3_4' }

####

layer { name: 'res1_branch1_path3' type: "Convolution" bottom: "res4f_weighted_e" top: 'res1_branch1_path3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path3' type: "Convolution" bottom: "res4f_weighted_e" top: 'res1_branch2a_path3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path3" bottom: "res1_branch1_path3"  bottom: "res1_branch2a_path3"
  top: "res1_path3" type: "Eltwise" eltwise_param { operation: 1 } }







layer { name: "elt_path3" bottom: "res1_path3"  bottom: "cropres2_path3_4"
  top: "elt_path3" type: "Eltwise" eltwise_param { operation: 1 } }














################################### PATH 2 ############################################
#path2_4


layer { name: 'res1_branch1_path2_4' type: "Convolution" bottom: "res5c_weighted_e" top: 'res1_branch1_path2_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path2_4' type: "Convolution" bottom: "res5c_weighted_e" top: 'res1_branch2a_path2_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path2_4" bottom: "res1_branch1_path2_4"  bottom: "res1_branch2a_path2_4"
  top: "res1_path2_4" type: "Eltwise" eltwise_param { operation: 1 } }



layer { bottom: 'res1_path2_4' top: 'trans_relu_path2_4' name: 'trans_relu_path2_4' type: "ReLU" }
layer { name: 'trans_path2_4' type: "Convolution" bottom: 'trans_relu_path2_4' top: 'trans_path2_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }
layer { type: "Deconvolution" name: 'upres2_path2_4' bottom: 'trans_path2_4' top: 'upres2_path2_4'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 8 stride: 4 num_output: 128 } }
layer { type: "Crop" name: 'cropres2_path2_4' bottom: 'upres2_path2_4' bottom: 'res3d_weighted_e' top: 'cropres2_path2_4' }


###path2_3



layer { name: 'res1_branch1_path2_3' type: "Convolution" bottom: "res4f_weighted_e" top: 'res1_branch1_path2_3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }


layer { name: 'res1_branch2a_path2_3' type: "Convolution" bottom: "res4f_weighted_e" top: 'res1_branch2a_path2_3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path2_3" bottom: "res1_branch1_path2_3"  bottom: "res1_branch2a_path2_3"
  top: "res1_path2_3" type: "Eltwise" eltwise_param { operation: 1 } }


layer { bottom: 'res1_path2_3' top: 'trans_relu_path2_3' name: 'trans_relu_path2_3' type: "ReLU" }
layer { name: 'trans_path2_3' type: "Convolution" bottom: 'trans_relu_path2_3' top: 'trans_path2_3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Deconvolution" name: 'upres2_path2_3' bottom: 'trans_path2_3' top: 'upres2_path2_3'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 4 stride: 2 num_output: 128 } }
layer { type: "Crop" name: 'cropres2_path2_3' bottom: 'upres2_path2_3' bottom: 'res3d_weighted_e' top: 'cropres2_path2_3' }

####

layer { name: 'res1_branch1_path2' type: "Convolution" bottom: 'res3d_weighted_e' top: 'res1_branch1_path2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path2' type: "Convolution" bottom: 'res3d_weighted_e' top: 'res1_branch2a_path2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path2" bottom: "res1_branch1_path2"  bottom: "res1_branch2a_path2"
  top: "res1_path2" type: "Eltwise" eltwise_param { operation: 1 } }


layer { bottom: 'res1_path2' top: 'trans_relu_path2' name: 'trans_relu_path2' type: "ReLU" }
layer { name: 'trans_path2' type: "Convolution" bottom: 'trans_relu_path2' top: 'trans_path2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }


layer { name: "elt_path2" bottom: "trans_path2"  bottom: "cropres2_path2_4" bottom: "cropres2_path2_3" 
  top: "elt_path2" type: "Eltwise" eltwise_param { operation: 1 } }















################################### PATH 1 ############################################
#path1_4



layer { name: 'res1_branch1_path1_4' type: "Convolution" bottom: "res5c_weighted_e" top: 'res1_branch1_path1_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path1_4' type: "Convolution" bottom: "res5c_weighted_e" top: 'res1_branch2a_path1_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path1_4" bottom: "res1_branch1_path1_4"  bottom: "res1_branch2a_path1_4"
  top: "res1_path1_4" type: "Eltwise" eltwise_param { operation: 1 } }


layer { bottom: 'res1_path1_4' top: 'trans_relu_path1_4' name: 'trans_relu_path1_4' type: "ReLU" }
layer { name: 'trans_path1_4' type: "Convolution" bottom: 'trans_relu_path1_4' top: 'trans_path1_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Deconvolution" name: 'upres2_path1_4' bottom: 'trans_path1_4' top: 'upres2_path1_4'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 16 stride: 8 num_output: 128 } }
layer { type: "Crop" name: 'cropres2_path1_4' bottom: 'upres2_path1_4' bottom: "res2c_weighted_e" top: 'cropres2_path1_4' }

###path1_3


layer { name: 'res1_branch1_path1_3' type: "Convolution" bottom: "res4f_weighted_e" top: 'res1_branch1_path1_3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path1_3' type: "Convolution" bottom: "res4f_weighted_e" top: 'res1_branch2a_path1_3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path1_3" bottom: "res1_branch1_path1_3"  bottom: "res1_branch2a_path1_3"
  top: "res1_path1_3" type: "Eltwise" eltwise_param { operation: 1 } }


layer { bottom: 'res1_path1_3' top: 'trans_relu_path1_3' name: 'trans_relu_path1_3' type: "ReLU" }
layer { name: 'trans_path1_3' type: "Convolution" bottom: 'trans_relu_path1_3' top: 'trans_path1_3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Deconvolution" name: 'upres2_path1_3' bottom: 'trans_path1_3' top: 'upres2_path1_3'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 8 stride: 4 num_output: 128 } }
layer { type: "Crop" name: 'cropres2_path1_3' bottom: 'upres2_path1_3' bottom: "res2c_weighted_e" top: 'cropres2_path1_3' }

###path1_2


layer { name: 'res1_branch1_path1_2' type: "Convolution" bottom: 'res3d_weighted_e' top: 'res1_branch1_path1_2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path1_2' type: "Convolution" bottom: 'res3d_weighted_e' top: 'res1_branch2a_path1_2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path1_2" bottom: "res1_branch1_path1_2"  bottom: "res1_branch2a_path1_2"
  top: "res1_path1_2" type: "Eltwise" eltwise_param { operation: 1 } }



layer { bottom: 'res1_path1_2' top: 'trans_relu_path1_2' name: 'trans_relu_path1_2' type: "ReLU" }
layer { name: 'trans_path1_2' type: "Convolution" bottom: 'trans_relu_path1_2' top: 'trans_path1_2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Deconvolution" name: 'upres2_path1_2' bottom: 'trans_path1_2' top: 'upres2_path1_2'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 4 stride: 2 num_output: 128 } }
layer { type: "Crop" name: 'cropres2_path1_2' bottom: 'upres2_path1_2' bottom: "res2c_weighted_e" top: 'cropres2_path1_2' }
####

layer { name: 'res1_branch1_path1' type: "Convolution" bottom: "res2c_weighted_e" top: 'res1_branch1_path1'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path1' type: "Convolution" bottom: "res2c_weighted_e" top: 'res1_branch2a_path1'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path1" bottom: "res1_branch1_path1"  bottom: "res1_branch2a_path1"
  top: "res1_path1" type: "Eltwise" eltwise_param { operation: 1 } }


layer { name: "elt_path1" bottom: "res1_path1"  bottom: "cropres2_path1_4"  bottom: "cropres2_path1_3" bottom: "cropres2_path1_2" 
  top: "elt_path1" type: "Eltwise" eltwise_param { operation: 1 } }











##### path0 ######
#path0_4



layer { name: 'res1_branch1_path0_4' type: "Convolution" bottom: "res5c_weighted_e" top: 'res1_branch1_path0_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path0_4' type: "Convolution" bottom: "res5c_weighted_e" top: 'res1_branch2a_path0_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path0_4" bottom: "res1_branch1_path0_4"  bottom: "res1_branch2a_path0_4"
  top: "res1_path0_4" type: "Eltwise" eltwise_param { operation: 1 } }


layer { bottom: 'res1_path0_4' top: 'trans_relu_path0_4' name: 'trans_relu_path0_4' type: "ReLU" }
layer { name: 'trans_path0_4' type: "Convolution" bottom: 'trans_relu_path0_4' top: 'trans_path0_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Deconvolution" name: 'upres2_path0_4' bottom: 'trans_path0_4' top: 'upres2_path0_4'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 16 stride: 8 num_output: 128 } }
layer { type: "Crop" name: 'cropres2_path0_4' bottom: 'upres2_path0_4' bottom: "res2c_weighted_e" top: 'cropres2_path0_4' }

###path0_3


layer { name: 'res1_branch1_path0_3' type: "Convolution" bottom: "res4f_weighted_e" top: 'res1_branch1_path0_3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path0_3' type: "Convolution" bottom: "res4f_weighted_e" top: 'res1_branch2a_path0_3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path0_3" bottom: "res1_branch1_path0_3"  bottom: "res1_branch2a_path0_3"
  top: "res1_path0_3" type: "Eltwise" eltwise_param { operation: 1 } }


layer { bottom: 'res1_path0_3' top: 'trans_relu_path0_3' name: 'trans_relu_path0_3' type: "ReLU" }
layer { name: 'trans_path0_3' type: "Convolution" bottom: 'trans_relu_path0_3' top: 'trans_path0_3'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Deconvolution" name: 'upres2_path0_3' bottom: 'trans_path0_3' top: 'upres2_path0_3'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 8 stride: 4 num_output: 128 } }
layer { type: "Crop" name: 'cropres2_path0_3' bottom: 'upres2_path0_3' bottom: "res2c_weighted_e" top: 'cropres2_path0_3' }

###path0_2


layer { name: 'res1_branch1_path0_2' type: "Convolution" bottom: 'res3d_weighted_e' top: 'res1_branch1_path0_2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path0_2' type: "Convolution" bottom: 'res3d_weighted_e' top: 'res1_branch2a_path0_2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path0_2" bottom: "res1_branch1_path0_2"  bottom: "res1_branch2a_path0_2"
  top: "res1_path0_2" type: "Eltwise" eltwise_param { operation: 1 } }



layer { bottom: 'res1_path0_2' top: 'trans_relu_path0_2' name: 'trans_relu_path0_2' type: "ReLU" }
layer { name: 'trans_path0_2' type: "Convolution" bottom: 'trans_relu_path0_2' top: 'trans_path0_2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Deconvolution" name: 'upres2_path0_2' bottom: 'trans_path0_2' top: 'upres2_path0_2'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 4 stride: 2 num_output: 128 } }
layer { type: "Crop" name: 'cropres2_path0_2' bottom: 'upres2_path0_2' bottom: "res2c_weighted_e" top: 'cropres2_path0_2' }



###path0_1


layer { name: 'res1_branch1_path0_1' type: "Convolution" bottom: 'res2c_weighted_e' top: 'res1_branch1_path0_1'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path0_1' type: "Convolution" bottom: 'res2c_weighted_e' top: 'res1_branch2a_path0_1'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path0_1" bottom: "res1_branch1_path0_1"  bottom: "res1_branch2a_path0_1"
  top: "res1_path0_1" type: "Eltwise" eltwise_param { operation: 1 } }



layer { bottom: 'res1_path0_1' top: 'trans_relu_path0_1' name: 'trans_relu_path0_1' type: "ReLU" }
layer { name: 'trans_path0_1' type: "Convolution" bottom: 'trans_relu_path0_1' top: 'trans_path0_1'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }


layer { type: "Crop" name: 'cropres2_path0_1' bottom: 'trans_path0_1' bottom: "res2c_weighted_e" top: 'cropres2_path0_1' }




####path0

layer { name: 'res1_branch1_path0' type: "Convolution" bottom: "pool1_weighted_e" top: 'res1_branch1_path0'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'res1_branch2a_path0' type: "Convolution" bottom: "pool1_weighted_e" top: 'res1_branch2a_path0'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 128 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "res1_path0" bottom: "res1_branch1_path0"  bottom: "res1_branch2a_path0"
  top: "res1_path0" type: "Eltwise" eltwise_param { operation: 1 } }


layer { name: "elt_path0" bottom: "res1_path0"  bottom: "cropres2_path0_4"  bottom: "cropres2_path0_3" bottom: "cropres2_path0_2" bottom: "cropres2_path0_1"
  top: "elt_path0" type: "Eltwise" eltwise_param { operation: 1 } }





  
  
  
  
  
  
  
  
  
  
  
  
  
  
#####Pyramid 2


################################### PATH 2 ############################################
# Prediction #



layer { name: 'pyramid2_res1_branch1_path2_4' type: "Convolution" bottom: "elt_path3" top: 'pyramid2_res1_branch1_path2_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'pyramid2_res1_branch2a_path2_4' type: "Convolution" bottom: "elt_path3" top: 'pyramid2_res1_branch2a_path2_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "pyramid2_res1_path2_4" bottom: "pyramid2_res1_branch1_path2_4"  bottom: "pyramid2_res1_branch2a_path2_4"
  top: "pyramid2_res1_path2_4" type: "Eltwise" eltwise_param { operation: 1 } }

  
  
layer { bottom: 'pyramid2_res1_path2_4' top: 'pyramid2_trans_relu_path2_4' name: 'pyramid2_trans_relu_path2_4' type: "ReLU" }
layer { name: 'pyramid2_trans_path2_4' type: "Convolution" bottom: 'pyramid2_trans_relu_path2_4' top: 'pyramid2_trans_path2_4'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { type: "Deconvolution" name: 'pyramid2_upres2_path2_4' bottom: 'pyramid2_trans_path2_4' top: 'pyramid2_upres2_path2_4'
  param { lr_mult: 0 decay_mult: 1 } param { lr_mult: 0 decay_mult: 0}
  convolution_param { kernel_size: 4 stride: 2 num_output: 256 } }
layer { type: "Crop" name: 'pyramid2_cropres2_path2_4' bottom: 'pyramid2_upres2_path2_4' bottom: "res3d_weighted_e" top: 'pyramid2_cropres2_path2_4' }

####

layer { name: 'pyramid2_res1_branch1_path2' type: "Convolution" bottom: "elt_path2" top: 'pyramid2_res1_branch1_path2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 0 kernel_size: 1
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: 'pyramid2_res1_branch2a_path2' type: "Convolution" bottom: "elt_path2" top: 'pyramid2_res1_branch2a_path2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3 
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }

layer { name: "pyramid2_res1_path2" bottom: "pyramid2_res1_branch1_path2"  bottom: "pyramid2_res1_branch2a_path2"
  top: "pyramid2_res1_path2" type: "Eltwise" eltwise_param { operation: 1 } }





layer { bottom: 'pyramid2_res1_path2' top: 'pyramid2_trans_relu_path2' name: 'pyramid2_trans_relu_path2' type: "ReLU" }
layer { name: 'pyramid2_trans_path2' type: "Convolution" bottom: 'pyramid2_trans_relu_path2' top: 'pyramid2_trans_path2'
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0}
  convolution_param { engine: CAFFE num_output: 256 pad: 1 kernel_size: 3
  weight_filler { type: "gaussian" std: 0.01 } bias_filler { type: "constant" value: 0 } } }


layer { name: "pyramid2_elt_path2" bottom: "pyramid2_trans_path2"  bottom: "pyramid2_cropres2_path2_4"
  top: "pyramid2_elt_path2" type: "Eltwise" eltwise_param { operation: 1 } }









