layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 32
    mean_file: "/home/andrew/Projects/caffe/examples/cifar10/mean.binaryproto"
  }
  data_param {
    source: "/home/andrew/Projects/caffe/examples/cifar10/cifar10_train_lmdb"
    batch_size: 128
    backend: LMDB
  }
  image_data_param {
    shuffle: true
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "conv1"
  top: "res2a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2a_branch1"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2a_branch1"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "conv1"
  top: "res2a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2a_branch2b"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2a_branch2b"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2b"
  top: "res2a"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2b_branch2b"
  type: "BatchNorm"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2b_branch2b"
  type: "Scale"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2b"
  top: "res2b"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2c_branch2b"
  type: "BatchNorm"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2c_branch2b"
  type: "Scale"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c"
  type: "Eltwise"
  bottom: "res2b"
  bottom: "res2c_branch2b"
  top: "res2c"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2c_relu"
  type: "ReLU"
  bottom: "res2c"
  top: "res2c"
}
layer {
  name: "res2d_branch2a"
  type: "Convolution"
  bottom: "res2c"
  top: "res2d_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2d_branch2a"
  type: "BatchNorm"
  bottom: "res2d_branch2a"
  top: "res2d_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2d_branch2a"
  type: "Scale"
  bottom: "res2d_branch2a"
  top: "res2d_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2d_branch2a_relu"
  type: "ReLU"
  bottom: "res2d_branch2a"
  top: "res2d_branch2a"
}
layer {
  name: "res2d_branch2b"
  type: "Convolution"
  bottom: "res2d_branch2a"
  top: "res2d_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2d_branch2b"
  type: "BatchNorm"
  bottom: "res2d_branch2b"
  top: "res2d_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2d_branch2b"
  type: "Scale"
  bottom: "res2d_branch2b"
  top: "res2d_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2d"
  type: "Eltwise"
  bottom: "res2c"
  bottom: "res2d_branch2b"
  top: "res2d"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2d_relu"
  type: "ReLU"
  bottom: "res2d"
  top: "res2d"
}
layer {
  name: "res2e_branch2a"
  type: "Convolution"
  bottom: "res2d"
  top: "res2e_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2e_branch2a"
  type: "BatchNorm"
  bottom: "res2e_branch2a"
  top: "res2e_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2e_branch2a"
  type: "Scale"
  bottom: "res2e_branch2a"
  top: "res2e_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2e_branch2a_relu"
  type: "ReLU"
  bottom: "res2e_branch2a"
  top: "res2e_branch2a"
}
layer {
  name: "res2e_branch2b"
  type: "Convolution"
  bottom: "res2e_branch2a"
  top: "res2e_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2e_branch2b"
  type: "BatchNorm"
  bottom: "res2e_branch2b"
  top: "res2e_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2e_branch2b"
  type: "Scale"
  bottom: "res2e_branch2b"
  top: "res2e_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2e"
  type: "Eltwise"
  bottom: "res2d"
  bottom: "res2e_branch2b"
  top: "res2e"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2e_relu"
  type: "ReLU"
  bottom: "res2e"
  top: "res2e"
}
layer {
  name: "res2f_branch2a"
  type: "Convolution"
  bottom: "res2e"
  top: "res2f_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2f_branch2a"
  type: "BatchNorm"
  bottom: "res2f_branch2a"
  top: "res2f_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2f_branch2a"
  type: "Scale"
  bottom: "res2f_branch2a"
  top: "res2f_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2f_branch2a_relu"
  type: "ReLU"
  bottom: "res2f_branch2a"
  top: "res2f_branch2a"
}
layer {
  name: "res2f_branch2b"
  type: "Convolution"
  bottom: "res2f_branch2a"
  top: "res2f_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2f_branch2b"
  type: "BatchNorm"
  bottom: "res2f_branch2b"
  top: "res2f_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2f_branch2b"
  type: "Scale"
  bottom: "res2f_branch2b"
  top: "res2f_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2f"
  type: "Eltwise"
  bottom: "res2e"
  bottom: "res2f_branch2b"
  top: "res2f"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2f_relu"
  type: "ReLU"
  bottom: "res2f"
  top: "res2f"
}
layer {
  name: "res2g_branch2a"
  type: "Convolution"
  bottom: "res2f"
  top: "res2g_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2g_branch2a"
  type: "BatchNorm"
  bottom: "res2g_branch2a"
  top: "res2g_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2g_branch2a"
  type: "Scale"
  bottom: "res2g_branch2a"
  top: "res2g_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2g_branch2a_relu"
  type: "ReLU"
  bottom: "res2g_branch2a"
  top: "res2g_branch2a"
}
layer {
  name: "res2g_branch2b"
  type: "Convolution"
  bottom: "res2g_branch2a"
  top: "res2g_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2g_branch2b"
  type: "BatchNorm"
  bottom: "res2g_branch2b"
  top: "res2g_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2g_branch2b"
  type: "Scale"
  bottom: "res2g_branch2b"
  top: "res2g_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2g"
  type: "Eltwise"
  bottom: "res2f"
  bottom: "res2g_branch2b"
  top: "res2g"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2g_relu"
  type: "ReLU"
  bottom: "res2g"
  top: "res2g"
}
layer {
  name: "res2h_branch2a"
  type: "Convolution"
  bottom: "res2g"
  top: "res2h_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2h_branch2a"
  type: "BatchNorm"
  bottom: "res2h_branch2a"
  top: "res2h_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2h_branch2a"
  type: "Scale"
  bottom: "res2h_branch2a"
  top: "res2h_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2h_branch2a_relu"
  type: "ReLU"
  bottom: "res2h_branch2a"
  top: "res2h_branch2a"
}
layer {
  name: "res2h_branch2b"
  type: "Convolution"
  bottom: "res2h_branch2a"
  top: "res2h_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2h_branch2b"
  type: "BatchNorm"
  bottom: "res2h_branch2b"
  top: "res2h_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2h_branch2b"
  type: "Scale"
  bottom: "res2h_branch2b"
  top: "res2h_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2h"
  type: "Eltwise"
  bottom: "res2g"
  bottom: "res2h_branch2b"
  top: "res2h"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2h_relu"
  type: "ReLU"
  bottom: "res2h"
  top: "res2h"
}
layer {
  name: "res2i_branch2a"
  type: "Convolution"
  bottom: "res2h"
  top: "res2i_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2i_branch2a"
  type: "BatchNorm"
  bottom: "res2i_branch2a"
  top: "res2i_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2i_branch2a"
  type: "Scale"
  bottom: "res2i_branch2a"
  top: "res2i_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2i_branch2a_relu"
  type: "ReLU"
  bottom: "res2i_branch2a"
  top: "res2i_branch2a"
}
layer {
  name: "res2i_branch2b"
  type: "Convolution"
  bottom: "res2i_branch2a"
  top: "res2i_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2i_branch2b"
  type: "BatchNorm"
  bottom: "res2i_branch2b"
  top: "res2i_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2i_branch2b"
  type: "Scale"
  bottom: "res2i_branch2b"
  top: "res2i_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2i"
  type: "Eltwise"
  bottom: "res2h"
  bottom: "res2i_branch2b"
  top: "res2i"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2i_relu"
  type: "ReLU"
  bottom: "res2i"
  top: "res2i"
}
layer {
  name: "res2j_branch2a"
  type: "Convolution"
  bottom: "res2i"
  top: "res2j_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2j_branch2a"
  type: "BatchNorm"
  bottom: "res2j_branch2a"
  top: "res2j_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2j_branch2a"
  type: "Scale"
  bottom: "res2j_branch2a"
  top: "res2j_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2j_branch2a_relu"
  type: "ReLU"
  bottom: "res2j_branch2a"
  top: "res2j_branch2a"
}
layer {
  name: "res2j_branch2b"
  type: "Convolution"
  bottom: "res2j_branch2a"
  top: "res2j_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2j_branch2b"
  type: "BatchNorm"
  bottom: "res2j_branch2b"
  top: "res2j_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2j_branch2b"
  type: "Scale"
  bottom: "res2j_branch2b"
  top: "res2j_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2j"
  type: "Eltwise"
  bottom: "res2i"
  bottom: "res2j_branch2b"
  top: "res2j"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2j_relu"
  type: "ReLU"
  bottom: "res2j"
  top: "res2j"
}
layer {
  name: "res2k_branch2a"
  type: "Convolution"
  bottom: "res2j"
  top: "res2k_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2k_branch2a"
  type: "BatchNorm"
  bottom: "res2k_branch2a"
  top: "res2k_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2k_branch2a"
  type: "Scale"
  bottom: "res2k_branch2a"
  top: "res2k_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2k_branch2a_relu"
  type: "ReLU"
  bottom: "res2k_branch2a"
  top: "res2k_branch2a"
}
layer {
  name: "res2k_branch2b"
  type: "Convolution"
  bottom: "res2k_branch2a"
  top: "res2k_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2k_branch2b"
  type: "BatchNorm"
  bottom: "res2k_branch2b"
  top: "res2k_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2k_branch2b"
  type: "Scale"
  bottom: "res2k_branch2b"
  top: "res2k_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2k"
  type: "Eltwise"
  bottom: "res2j"
  bottom: "res2k_branch2b"
  top: "res2k"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2k_relu"
  type: "ReLU"
  bottom: "res2k"
  top: "res2k"
}
layer {
  name: "res2l_branch2a"
  type: "Convolution"
  bottom: "res2k"
  top: "res2l_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2l_branch2a"
  type: "BatchNorm"
  bottom: "res2l_branch2a"
  top: "res2l_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2l_branch2a"
  type: "Scale"
  bottom: "res2l_branch2a"
  top: "res2l_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2l_branch2a_relu"
  type: "ReLU"
  bottom: "res2l_branch2a"
  top: "res2l_branch2a"
}
layer {
  name: "res2l_branch2b"
  type: "Convolution"
  bottom: "res2l_branch2a"
  top: "res2l_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2l_branch2b"
  type: "BatchNorm"
  bottom: "res2l_branch2b"
  top: "res2l_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2l_branch2b"
  type: "Scale"
  bottom: "res2l_branch2b"
  top: "res2l_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2l"
  type: "Eltwise"
  bottom: "res2k"
  bottom: "res2l_branch2b"
  top: "res2l"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2l_relu"
  type: "ReLU"
  bottom: "res2l"
  top: "res2l"
}
layer {
  name: "res2m_branch2a"
  type: "Convolution"
  bottom: "res2l"
  top: "res2m_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2m_branch2a"
  type: "BatchNorm"
  bottom: "res2m_branch2a"
  top: "res2m_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2m_branch2a"
  type: "Scale"
  bottom: "res2m_branch2a"
  top: "res2m_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2m_branch2a_relu"
  type: "ReLU"
  bottom: "res2m_branch2a"
  top: "res2m_branch2a"
}
layer {
  name: "res2m_branch2b"
  type: "Convolution"
  bottom: "res2m_branch2a"
  top: "res2m_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2m_branch2b"
  type: "BatchNorm"
  bottom: "res2m_branch2b"
  top: "res2m_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2m_branch2b"
  type: "Scale"
  bottom: "res2m_branch2b"
  top: "res2m_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2m"
  type: "Eltwise"
  bottom: "res2l"
  bottom: "res2m_branch2b"
  top: "res2m"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2m_relu"
  type: "ReLU"
  bottom: "res2m"
  top: "res2m"
}
layer {
  name: "res2n_branch2a"
  type: "Convolution"
  bottom: "res2m"
  top: "res2n_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2n_branch2a"
  type: "BatchNorm"
  bottom: "res2n_branch2a"
  top: "res2n_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2n_branch2a"
  type: "Scale"
  bottom: "res2n_branch2a"
  top: "res2n_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2n_branch2a_relu"
  type: "ReLU"
  bottom: "res2n_branch2a"
  top: "res2n_branch2a"
}
layer {
  name: "res2n_branch2b"
  type: "Convolution"
  bottom: "res2n_branch2a"
  top: "res2n_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2n_branch2b"
  type: "BatchNorm"
  bottom: "res2n_branch2b"
  top: "res2n_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2n_branch2b"
  type: "Scale"
  bottom: "res2n_branch2b"
  top: "res2n_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2n"
  type: "Eltwise"
  bottom: "res2m"
  bottom: "res2n_branch2b"
  top: "res2n"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2n_relu"
  type: "ReLU"
  bottom: "res2n"
  top: "res2n"
}
layer {
  name: "res2o_branch2a"
  type: "Convolution"
  bottom: "res2n"
  top: "res2o_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2o_branch2a"
  type: "BatchNorm"
  bottom: "res2o_branch2a"
  top: "res2o_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2o_branch2a"
  type: "Scale"
  bottom: "res2o_branch2a"
  top: "res2o_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2o_branch2a_relu"
  type: "ReLU"
  bottom: "res2o_branch2a"
  top: "res2o_branch2a"
}
layer {
  name: "res2o_branch2b"
  type: "Convolution"
  bottom: "res2o_branch2a"
  top: "res2o_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2o_branch2b"
  type: "BatchNorm"
  bottom: "res2o_branch2b"
  top: "res2o_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2o_branch2b"
  type: "Scale"
  bottom: "res2o_branch2b"
  top: "res2o_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2o"
  type: "Eltwise"
  bottom: "res2n"
  bottom: "res2o_branch2b"
  top: "res2o"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2o_relu"
  type: "ReLU"
  bottom: "res2o"
  top: "res2o"
}
layer {
  name: "res2p_branch2a"
  type: "Convolution"
  bottom: "res2o"
  top: "res2p_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2p_branch2a"
  type: "BatchNorm"
  bottom: "res2p_branch2a"
  top: "res2p_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2p_branch2a"
  type: "Scale"
  bottom: "res2p_branch2a"
  top: "res2p_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2p_branch2a_relu"
  type: "ReLU"
  bottom: "res2p_branch2a"
  top: "res2p_branch2a"
}
layer {
  name: "res2p_branch2b"
  type: "Convolution"
  bottom: "res2p_branch2a"
  top: "res2p_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2p_branch2b"
  type: "BatchNorm"
  bottom: "res2p_branch2b"
  top: "res2p_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2p_branch2b"
  type: "Scale"
  bottom: "res2p_branch2b"
  top: "res2p_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2p"
  type: "Eltwise"
  bottom: "res2o"
  bottom: "res2p_branch2b"
  top: "res2p"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2p_relu"
  type: "ReLU"
  bottom: "res2p"
  top: "res2p"
}
layer {
  name: "res2q_branch2a"
  type: "Convolution"
  bottom: "res2p"
  top: "res2q_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2q_branch2a"
  type: "BatchNorm"
  bottom: "res2q_branch2a"
  top: "res2q_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2q_branch2a"
  type: "Scale"
  bottom: "res2q_branch2a"
  top: "res2q_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2q_branch2a_relu"
  type: "ReLU"
  bottom: "res2q_branch2a"
  top: "res2q_branch2a"
}
layer {
  name: "res2q_branch2b"
  type: "Convolution"
  bottom: "res2q_branch2a"
  top: "res2q_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2q_branch2b"
  type: "BatchNorm"
  bottom: "res2q_branch2b"
  top: "res2q_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2q_branch2b"
  type: "Scale"
  bottom: "res2q_branch2b"
  top: "res2q_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2q"
  type: "Eltwise"
  bottom: "res2p"
  bottom: "res2q_branch2b"
  top: "res2q"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2q_relu"
  type: "ReLU"
  bottom: "res2q"
  top: "res2q"
}
layer {
  name: "res2r_branch2a"
  type: "Convolution"
  bottom: "res2q"
  top: "res2r_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2r_branch2a"
  type: "BatchNorm"
  bottom: "res2r_branch2a"
  top: "res2r_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2r_branch2a"
  type: "Scale"
  bottom: "res2r_branch2a"
  top: "res2r_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2r_branch2a_relu"
  type: "ReLU"
  bottom: "res2r_branch2a"
  top: "res2r_branch2a"
}
layer {
  name: "res2r_branch2b"
  type: "Convolution"
  bottom: "res2r_branch2a"
  top: "res2r_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn2r_branch2b"
  type: "BatchNorm"
  bottom: "res2r_branch2b"
  top: "res2r_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale2r_branch2b"
  type: "Scale"
  bottom: "res2r_branch2b"
  top: "res2r_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2r"
  type: "Eltwise"
  bottom: "res2q"
  bottom: "res2r_branch2b"
  top: "res2r"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2r_relu"
  type: "ReLU"
  bottom: "res2r"
  top: "res2r"
}
layer {
  name: "res3a_branch1"
  type: "Convolution"
  bottom: "res2r"
  top: "res3a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3a_branch1"
  type: "BatchNorm"
  bottom: "res3a_branch1"
  top: "res3a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3a_branch1"
  type: "Scale"
  bottom: "res3a_branch1"
  top: "res3a_branch1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a_branch2a"
  type: "Convolution"
  bottom: "res2r"
  top: "res3a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3a_branch2a"
  type: "BatchNorm"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3a_branch2a"
  type: "Scale"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a_branch2a_relu"
  type: "ReLU"
  bottom: "res3a_branch2a"
  top: "res3a_branch2a"
}
layer {
  name: "res3a_branch2b"
  type: "Convolution"
  bottom: "res3a_branch2a"
  top: "res3a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3a_branch2b"
  type: "BatchNorm"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3a_branch2b"
  type: "Scale"
  bottom: "res3a_branch2b"
  top: "res3a_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3a"
  type: "Eltwise"
  bottom: "res3a_branch1"
  bottom: "res3a_branch2b"
  top: "res3a"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3a_relu"
  type: "ReLU"
  bottom: "res3a"
  top: "res3a"
}
layer {
  name: "res3b_branch2a"
  type: "Convolution"
  bottom: "res3a"
  top: "res3b_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3b_branch2a"
  type: "BatchNorm"
  bottom: "res3b_branch2a"
  top: "res3b_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3b_branch2a"
  type: "Scale"
  bottom: "res3b_branch2a"
  top: "res3b_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b_branch2a_relu"
  type: "ReLU"
  bottom: "res3b_branch2a"
  top: "res3b_branch2a"
}
layer {
  name: "res3b_branch2b"
  type: "Convolution"
  bottom: "res3b_branch2a"
  top: "res3b_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3b_branch2b"
  type: "BatchNorm"
  bottom: "res3b_branch2b"
  top: "res3b_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3b_branch2b"
  type: "Scale"
  bottom: "res3b_branch2b"
  top: "res3b_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b"
  type: "Eltwise"
  bottom: "res3a"
  bottom: "res3b_branch2b"
  top: "res3b"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3b_relu"
  type: "ReLU"
  bottom: "res3b"
  top: "res3b"
}
layer {
  name: "res3c_branch2a"
  type: "Convolution"
  bottom: "res3b"
  top: "res3c_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3c_branch2a"
  type: "BatchNorm"
  bottom: "res3c_branch2a"
  top: "res3c_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3c_branch2a"
  type: "Scale"
  bottom: "res3c_branch2a"
  top: "res3c_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3c_branch2a_relu"
  type: "ReLU"
  bottom: "res3c_branch2a"
  top: "res3c_branch2a"
}
layer {
  name: "res3c_branch2b"
  type: "Convolution"
  bottom: "res3c_branch2a"
  top: "res3c_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3c_branch2b"
  type: "BatchNorm"
  bottom: "res3c_branch2b"
  top: "res3c_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3c_branch2b"
  type: "Scale"
  bottom: "res3c_branch2b"
  top: "res3c_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3c"
  type: "Eltwise"
  bottom: "res3b"
  bottom: "res3c_branch2b"
  top: "res3c"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3c_relu"
  type: "ReLU"
  bottom: "res3c"
  top: "res3c"
}
layer {
  name: "res3d_branch2a"
  type: "Convolution"
  bottom: "res3c"
  top: "res3d_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3d_branch2a"
  type: "BatchNorm"
  bottom: "res3d_branch2a"
  top: "res3d_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3d_branch2a"
  type: "Scale"
  bottom: "res3d_branch2a"
  top: "res3d_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3d_branch2a_relu"
  type: "ReLU"
  bottom: "res3d_branch2a"
  top: "res3d_branch2a"
}
layer {
  name: "res3d_branch2b"
  type: "Convolution"
  bottom: "res3d_branch2a"
  top: "res3d_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3d_branch2b"
  type: "BatchNorm"
  bottom: "res3d_branch2b"
  top: "res3d_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3d_branch2b"
  type: "Scale"
  bottom: "res3d_branch2b"
  top: "res3d_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3d"
  type: "Eltwise"
  bottom: "res3c"
  bottom: "res3d_branch2b"
  top: "res3d"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3d_relu"
  type: "ReLU"
  bottom: "res3d"
  top: "res3d"
}
layer {
  name: "res3e_branch2a"
  type: "Convolution"
  bottom: "res3d"
  top: "res3e_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3e_branch2a"
  type: "BatchNorm"
  bottom: "res3e_branch2a"
  top: "res3e_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3e_branch2a"
  type: "Scale"
  bottom: "res3e_branch2a"
  top: "res3e_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3e_branch2a_relu"
  type: "ReLU"
  bottom: "res3e_branch2a"
  top: "res3e_branch2a"
}
layer {
  name: "res3e_branch2b"
  type: "Convolution"
  bottom: "res3e_branch2a"
  top: "res3e_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3e_branch2b"
  type: "BatchNorm"
  bottom: "res3e_branch2b"
  top: "res3e_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3e_branch2b"
  type: "Scale"
  bottom: "res3e_branch2b"
  top: "res3e_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3e"
  type: "Eltwise"
  bottom: "res3d"
  bottom: "res3e_branch2b"
  top: "res3e"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3e_relu"
  type: "ReLU"
  bottom: "res3e"
  top: "res3e"
}
layer {
  name: "res3f_branch2a"
  type: "Convolution"
  bottom: "res3e"
  top: "res3f_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn3f_branch2a"
  type: "BatchNorm"
  bottom: "res3f_branch2a"
  top: "res3f_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale3f_branch2a"
  type: "Scale"
  bottom: "res3f_branch2a"
  top: "res3f_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3f_branch2a_relu"
  type: "ReLU"
  bottom: "res3f_branch2a"
  top: "res3f_branch2a"
}
layer {
  name: "res3f_branch2b"
  type: "Convolution"
